@echo off
title 修复中
Echo 正在关闭所有恶意行为。。。。。。
Echo ---------------------------------------------
Echo 正在为您的电脑清理垃圾。。。。。。
Echo ---------------------------------------------
Echo 正在隔离恶意病毒。。。。。。
Echo ---------------------------------------------
Echo 正在备份重要文件以及大文件。。。。。。
Echo ---------------------------------------------
Echo 正在终止威胁此电脑的进程。。。。。。
Echo ---------------------------------------------
Echo 正在重点保护易感染的文件。。。。。。
Echo ---------------------------------------------
Echo 正在管理可疑的程序。。。。。。
Echo ---------------------------------------------
Echo 正在修复系统漏洞。。。。。。
Echo ---------------------------------------------
Echo 估计需要3小时完工，请耐心等待。。。。。。
Echo ---------------------------------------------
Echo 所有任务完成后将生成修复报告
Echo ---------------------------------------------
pause
color 7
dir/s
echo 检测无问题，本计算机状态良好>>报告单.txt
copy *.txt 报告单.txt
find "检测无问题，本计算机状态良好" 报告单.txt
@pause